app/admin/users.rb

DELETE FROM "imported_users"
---
   active_admin_import validate: false,
            #csv_options: {col_sep: ";" },
            resource_class: ImportedUser ,  # we import data into another resource
            before_import: ->(importer){  ImportedUser.delete_all },
            after_import:  ->(importer){